<template lang="pug">
  div
    h3 何謂APCS
    p APCS為Advanced Placement Computer Science的英文縮寫，是指「大學程式設計先修檢測」。其檢測模式乃參考美國大學先修課程（Advanced Placement，AP），與各大學合作命題，並確定檢定用題目經過信效度考驗，以確保檢定結果之公信力。
    h3 緣由
    p 程式設計在資訊科學當中扮演著基礎並重要的角色。學生透過撰寫程式能夠實驗課堂中學習到的理論並發揮自己的創意寫出各式各樣功能的軟體。如今學生的資訊能力日益受到重視，而公部門討論的大學先修課程檢定測驗，未觸及資訊科學，且資訊科學並不在學測考試項目中，不論在推薦入學、申請入學或考試入學等入學管道，對於學生的資訊能力尚缺乏客觀的評量依據。
    h3 廢文
    p APCS勢必能夠左右未來。在人類的歷史中，我們總是盡了一切努力想搞懂APCS。若能夠欣賞到APCS的美，相信我們一定會對APCS改觀。說到APCS，你會想到什麼呢？羅大經說過一句經典的名言，成人不自在，自在不成人。這段話非常有意思。伊索在不經意間這樣說過，那此忘恩的人，落在困難之中，是不能得救的。請諸位將這段話在心中默念三遍。做好APCS這件事，可以說已經成為了全民運動。塞涅卡說過一句富有哲理的話，如果一個人不知道他要駛向哪個碼頭，那麼任何風都不會是順風。這段話讓我的心境提高了一個層次。這樣看來，我以為我了解APCS，但我真的了解APCS嗎？仔細想想，我對APCS的理解只是皮毛而已。世界上若沒有APCS，對於人類的改變可想而知。我們一般認為，抓住了問題的關鍵，其他一切則會迎刃而解。我們要從本質思考，從根本解決問題。約爾旦深信，智慧表現在下一次該怎麼做，美德則表現在行為本身。帶著這句話，我們還要更加慎重的審視這個問題。帕斯卡爾曾說過一句意義深遠的話，無論身份高低，只要會消遣就是幸福。這不禁令我重新仔細的思考。總結來說，加納說過一句富有哲理的話，公雞被酒陶醉的時候，正是兀鷹進攻的好時機。這是撼動人心的。APCS可以說是有著成為常識的趨勢。若發現問題比我們想像的還要深奧，那肯定不簡單。看看別人，再想想自己，會發現問題的核心其實就在你身旁。李賀曾提出，男兒何不帶吳鉤，收取關山五十州。想必各位已經看出了其中的端倪。阿卜·日·法拉茲說過一句經典的名言，學問是異常珍貴的東西，從任何源泉吸收都不可恥。這段話對世界的改變有著深遠的影響。若沒有APCS的存在，那麼後果可想而知。APCS的出現，重寫了人生的意義。探討APCS時，如果發現非常複雜，那麼想必不簡單。總而言之，如果此時我們選擇忽略APCS，那後果可想而知。我們不得不面對一個非常尷尬的事實，那就是，我們要學會站在別人的角度思考。亦舒深信，人生短短數十載，最要緊的是滿足自己，不是討好他人。這不禁令我深思。我們都很清楚，這是個嚴謹的議題。這種事實對本人來說意義重大，相信對這個世界也是有一定意義的。深入的探討APCS，是釐清一切的關鍵。APCS的出現，必將帶領人類走向更高的巔峰。若無法徹底理解APCS，恐怕會是人類的一大遺憾。每個人都不得不面對這些問題。在面對這種問題時，務必詳細考慮APCS的各種可能。考爾德曾經提到過，僅次於選擇益友，就是選擇好書。希望大家能發現話中之話。一般來說，APCS對我來說，已經成為了我生活的一部分。羅布萊斯說過一句富有哲理的話，一個男人，不管是誰，自尊心受到傷害時，都會鋌而走險，做出喪失理智的事。這讓我對於看待這個問題的方法有了巨大的改變。
    h3 反正很重要就對了
</template>

<script>
import Vue from 'vue';

export default Vue.extend({

})
</script>

<style lang="scss" scoped>
p {
  line-height: 1.8;
}
</style>