<template lang="pug">
  div   
    h3 關於我們
    ul
      li 我們是一群來自國立臺灣大學的學生，因為對程式設計與演算法的熱愛，我們在此相遇、集結，並成為互相討論、分享的夥伴。我們絕大多數的人都參與了臺大的培訓班與國際大學生程式設計競賽，每年參加 ICPC 區域賽都取得極佳的成績，並且獲得參加世界總決賽的資格。然而，這樣的經驗並沒有讓我們滿足。
      li 我們其中的許多人從國、高中就已經開始接觸程式設計，然而在求學的路途中我們發現，在臺灣，程式教育相較於其他科目非常不普及。這使得許多對程式有興趣的同學只能獨自學習，知識來源則只能透過書本或網路自行尋找，當有所疑惑之時也無人相互討論。於是我們從 2014 年開始舉辦「程式競賽解題集訓營（IOICAMP）」，讓對資訊奧林匹亞有興趣的同學能認識並切磋交流。然而由於資源有限，「程式競賽解題集訓營」每年只有大約 60 位學員能參加，且由於營隊的內容較為進階且為競賽導向，對初學者或是單純想學程式的同學來說實在難以接近。
    h3 營隊設計與宗旨
    ul
      li 我們營隊將開設兩種難度的課程：針對沒有基礎的學生，我們期望透過密集訓練程式解題的方式，使學生在短時間內了解基本的程式運作和編寫，考取 APCS 實作部分階段性的成績；而對於已經有語言基礎的學生，我們則透過高密度、高品質的演算法課程帶領學生踏入演算法與程式設計的領域，讓學生在擴大其原有視野的同時，具備考取 APCS 實作部分高分的能力。
      li 我們希望透過此活動能以正確的方式培養臺灣學生的程式能力，增進國高中生對程式語言和程式設計與演算法的基本了解。若能讓更多臺灣學生能從小就接受到正確、完善的資訊教育，相信能增加臺灣學生的資訊素養，而此結果正是我們所期待的。
</template>

<script>
import Vue from 'vue';

export default Vue.extend({

})
</script>

<style>

</style>
