<template lang="pug">
  div
    h3 營隊對象
    ul
      li 任何有志參與 APCS 考試或對程式設計有興趣的同學，不限年齡都可以喔！
    h3 營隊時間
    ul
      li 2021 年 08 月 02 日（一）至 2021 年 08 月 13 日（五），共兩週，不含假日。
      li 語法班上課時間為每日 09:00 至 12:30 ，算法班上課時間為每日 13:30 至 17:00 。
      li 其中學員可自由選擇是否去助教時間問問題。
    h3 營隊地點
    ul
      li 考量疫情趨勢與我們期望打破地理限制的初衷，我們決定<b>線上</b>舉行本次營隊，期望讓全臺各地想精進程式能力的初學者都能參與。我們會努力利用各種線上平臺來創造與實體相仿的營隊體驗。
      li 需要自備電腦和穩定的網路環境。
    h3 營隊資源
    ol
      li 眾多的練習題和線上評測系統
      li 線上討論區供同學發問與討論
      li 透過線上會議軟體直播上課，並透過像 Slido 的軟體讓學生與講師互動
      li 透過線上會議軟體讓同學和助教與其他同學直接交流（需開鏡頭和麥克風）
      li 提供上課影片和題目講解影片供學生重複觀看
    h3 營隊費用
    p 本次營隊提供兩種方案供學員自由選擇。
    ul
      li 一般方案：語法班 8500，算法班 8500 。所有資源皆可存取和參與。
      li 非同步自主學習方案：語法班 6900，算法班 6900 。以觀看課程影片的方式自主學習，不能參與課程直播和助教時間(上列的第三點和第四點)；其餘所有資源皆可存取。
    p 注意到雖單一課程時間為半天，但我們預期學員須要花一整天的時間上課和練習，才能夠達到預期的訓練效果。所以有意願同時報名兩班的學員，請謹慎估計所需的時間。
    h3 主辦單位與協辦單位
    ul
      li 主辦單位：台大 ICPC 程式設計競賽培訓班
      li 協辦單位：台大程式解題社
</template>

<script>
import Vue from 'vue';

export default Vue.extend({

})
</script>

<style>

</style>
