<template lang="pug">
  div
    p 最新消息和 FAQ 都會跟新在這裡喔！
    h3 最新消息
    ul
      li （05/19 更新）感謝贊助商，同步班／非同步班的報名費已調降至 7500／5900！
      li （05/19 更新）感謝贊助商，我們決定推出團報優惠！詳情請參考
        a(href="#information") 這裡
      li （05/10 更新）報名開始摟！請參考本頁面的
        a(href="#register") 「立即報名」
    h3 FAQ
    ul
      li 預計使用哪些線上平台？
      ul
        li 請參考 <a href="#information">「營隊資訊」</a>
      li 營隊資源可以存取多久？
        ul
          li 課程錄影、題目和線上評測系統都會開放到營隊結束後第二次的 APCS 考試以前
      li 請問報名截止日為？
        ul
          li 即日起至6/27（日），先到先審
      li 影片什麼時候會釋出？
        ul 
          li 當天下課就會上傳，上傳後就可以觀看了～
      li 語法班為何會選擇教 C/C++ 呢？
        ul
          li 比較好銜接後面的課程。
      li 是否會有相關證書呢？
        ul
          li 只要報名並完整參加就會有「參加證書」。
          li 「結業證書」的話則需參與營隊活動和課程並完成一定比例的習題。
      li 適合一次參加兩個班嗎？
        ul
          li 雖單一課程（語法或算法）時間為半天，但我們預期學員須要花一整天的時間上課和練習，才能夠達到預期的訓練效果。 如果您是有意願同時報名兩班的學員，請謹慎估計所需的時間。
          li 若真的想參加兩個班的話，建議其中一個班以非同步的方式學習。
    h3 贊助資訊
    ul
      li 也想與我們合作，成為贊助商嗎？
      li 歡迎聯絡 <a href="mailto:apcscamp@csie.ntu.edu.tw">apcscamp@csie.ntu.edu.tw</a>！
      li 想直接捐款的話也可以！以下是捐款資訊：
      ul
        li 戶名：國立台灣大學401專戶
        li 分行：華南商業銀行台大分行
        li 帳號：154360000028
        li 另外，請於匯款單註明「程式解題社活動捐款」，匯款後請傳真匯款單至(02)23661952，並將匯款時間、您的帳號、收據的收受人、收據郵寄地址通知本營隊(見上面的電子郵件)。
</template>

<script>
import Vue from 'vue';

export default Vue.extend({

})
</script>

<style>

</style>
