<template lang="pug">
  div
    p 最新消息和 FAQ 都會更新在這裡喔！
    h3 最新消息
    ul
      li 報名開始囉！請點
        a(href="#register") 這裡
        | 。
    h3 FAQ
    ul
      li 營隊資源可以存取多久？
        ul
          li 課程錄影、題目和線上評測系統都會開放到營隊結束後第二次的 APCS 考試以前。
      li 請問報名截止日為？
        ul
          li 即日起至 6/30（四），先到先審。
      li 影片什麼時候會釋出？
        ul 
          li 當天下課就會上傳，上傳後就可以觀看了～
      li 語法班為何會選擇教 C/C++ 呢？
        ul
          li 比較好銜接後面的課程。
      li 是否會有相關證書呢？
        ul
          li 只要報名並完整參加就會有「參加證書」。
          li 「結業證書」的話則需完成一定比例的習題。
      li 適合一次參加兩個班嗎？
        ul
          li 雖單一課程（語法或算法）時間為半天，但我們預期學員須要花一整天的時間上課和練習，才能夠達到預期的訓練效果。如果您是有意願同時報名兩班的學員，請謹慎估計所需的時間。
      li 為什麼取消「非同步」方案？
        ul
          li 由於非同步方案的學生沒有即時跟課，根據我們的課後追蹤與解題紀錄，去年非同步方案的學生學習成效普遍不彰，因此決定擴大助教團隊，將原先非同步方案的名額，一併轉成同步，以提升學生學習成效！
      li 有沒有加開其他梯次的營期？
        ul
          li 我們是一年一度的營隊，不是補習班的形式，為避免連續舉辦多梯次造成營隊品質下降的可能性，我們目前的規劃是每年舉辦一次，也因此我們每年四月初就會公佈營期，希望學生能提早規劃時間！
</template>

<script>
import Vue from 'vue';

export default Vue.extend({

})
</script>

<style>

</style>
